# Отсортируйте по убыванию методом пузырька одномерный целочисленный массив, заданный случайными числами на
# промежутке [-100; 100). Выведите на экран исходный и отсортированный массивы.
# Примечания:
# ● алгоритм сортировки должен быть в виде функции, которая принимает на вход массив данных,
# ● постарайтесь сделать алгоритм умнее, но помните, что у вас должна остаться сортировка пузырьком.
# Улучшенные версии сортировки, например, расчёской, шейкерная и другие в зачёт не идут.
import random

SIZE = 10
MIN_ITEM = -100
MAX_ITEM = 99
array = [random.randint(MIN_ITEM, MAX_ITEM) for _ in range(SIZE)]


def bubble_sort(arr): # Если просто усовершенствовать метод пузырька, то нужно заменить range(len(arr) - 1) на range(len(arr) - n)

    n = 1
    while n < len(arr):
        for i in range(len(arr) - n):
            if arr[i] < arr[i + 1]: # Для обратной сортировки поменял знак
                arr[i], arr[i + 1] = arr[i + 1], arr[i]
        n += 1
    return arr


print(f'Первоначальный массив: \n {array}')
print(f'Отсортированный в обратном порядке массив: \n {bubble_sort(array)}')




